<a href="https://colab.research.google.com/github/AudryBarimbane/Python_Machine_Learning/blob/main/02_sklearn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**2.Classification : Survivants du Titanic**

In [1]:
data = 'https://raw.githubusercontent.com/AudryBarimbane/pandas_data_analysis_python/main/titanic3.csv'

In [2]:
!wget $data

--2021-10-10 05:13:50--  https://raw.githubusercontent.com/AudryBarimbane/pandas_data_analysis_python/main/titanic3.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 108486 (106K) [text/plain]
Saving to: ‘titanic3.csv’

titanic3.csv        100%[===================>] 105.94K  --.-KB/s    in 0.002s

2021-10-10 05:13:50 (51.4 MB/s) - ‘titanic3.csv’ saved [108486/108486]

In [3]:
import pandas as pd
import seaborn as sns
import numpy as np

In [4]:
#titanic = sns.load_dataset('titanic3.csv')
titanic = pd.read_csv('titanic3.csv')

In [5]:
titanic.shape

(1309, 14)

In [6]:
titanic.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [7]:
titanic = titanic[['survived','pclass','sex','age']]
titanic.dropna(axis=0,inplace=True) #éliminer les données manquantes dans le dataset 
titanic['sex'].replace(['male','female'],[0,1], inplace=True)
titanic.head()

   survived  pclass  sex      age
0         1       1    1  29.0000
1         1       1    0   0.9167
2         0       1    1   2.0000
3         0       1    0  30.0000
4         0       1    1  25.0000

In [8]:
from sklearn.neighbors import KNeighborsClassifier

In [9]:
model = KNeighborsClassifier()

In [10]:
y = titanic['survived']
X = titanic.drop('survived',axis=1)

In [11]:
y

0       1
1       1
2       0
3       0
4       0
       ..
1301    0
1304    0
1306    0
1307    0
1308    0
Name: survived, Length: 1046, dtype: int64

In [12]:
X

      pclass  sex      age
0          1    1  29.0000
1          1    0   0.9167
2          1    1   2.0000
3          1    0  30.0000
4          1    1  25.0000
...      ...  ...      ...
1301       3    0  45.5000
1304       3    1  14.5000
1306       3    0  26.5000
1307       3    0  27.0000
1308       3    0  29.0000

[1046 rows x 3 columns]

In [13]:
model.fit(X,y)
model.score(X,y)

0.8279158699808795

Notre modèle effectue une bonne prédiction dans 82% des cas

In [14]:
model.predict(X)

array([1, 1, 1, ..., 0, 0, 0])

In [15]:
def survie(model,pclass=3,sex=0,age=26):
  X = np.array([pclass, sex, age]).reshape(1,3) #(reshape(1,3): 1 ligne et 3 colonne notre tableau a 2 dimensions)
  print(model.predict(X))
  print(model.predict_proba(X))

In [16]:
survie(model)

[0]
[[0.8 0.2]]